import { Task } from '../models/Task';

export const tasks: Task[] = [
  {
    id: '123123',
    title: 'Задача 1',
    description:
      'Формалировка задачи Формалировка задачи Формалировка задачи Формалировка задачи',
    type: 'single',
    answers: [
      {
        id: '1',
        value: 'Вариант ответа 1',
      },
      {
        id: '2',
        value: 'Вариант ответа 2',
      },
      {
        id: '3',
        value: 'Вариант ответа 3',
      },
    ],
  },
  {
    id: '123124',
    title: 'Задача 2',
    description:
      'Формалировка задачи Формалировка задачи Формалировка задачи Формалировка задачи',
    type: 'single',
    answers: [
      {
        id: '1',
        value: 'Вариант ответа 1',
      },
      {
        id: '2',
        value: 'Вариант ответа 2',
      },
      {
        id: '3',
        value: 'Вариант ответа 3',
      },
    ],
  },
  {
    id: '123125',
    title: 'Задача 3',
    description:
      'Формалировка задачи Формалировка задачи Формалировка задачи Формалировка задачи',
    type: 'single',
    answers: [
      {
        id: '1',
        value: 'Вариант ответа 1',
      },
      {
        id: '2',
        value: 'Вариант ответа 2',
      },
      {
        id: '3',
        value: 'Вариант ответа 3',
      },
    ],
  },
];
